DELETE FROM dishes;
DELETE FROM restaurants;
DELETE FROM users;

ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email)
VALUES ('User', 'user@gmail.com'),
       ('Admin', 'admin@gmail.com');

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO restaurants (name)
VALUES ('Итальянский ресторан'),
       ('Суши бар'),
       ('Китайский ресторан');

INSERT INTO dishes (name, price, date, restaurant)
VALUES ('Паста', 890, '2020-07-04', 100002),
        ('Спагетти', 486, '2020-07-03', 100002),
        ('Пицца', 562, '2020-07-04', 100002),
        ('Лазанья', 740, '2020-07-03', 100002),
        ('Роллы калифорния', 430, '2020-07-05', 100003),
        ('Суши с тунцом', 490, '2020-07-05', 100003),
        ('Сашими', 640, '2020-07-07', 100003),
        ('Сяке', 620, '2020-07-05', 100003),
        ('Лапша', 730, '2020-07-05', 100004),
        ('Утра по пекински', 1500, '2020-07-04', 100004),
        ('Димсамы', 350, '2020-07-04', 100004),
        ('Китайский суп', 520, '2020-07-05', 100004);

INSERT INTO votes (restaurant, user, date_time)
VALUES (100003, 100000, '2020-07-07 10:00:00'),
       (100002, 100001, '2020-07-07 10:00:00'),
       (100002, 100000, '2020-07-07 10:00:00'),
       (100004, 100001, '2020-07-07 12:00:00');
