DELETE FROM dishes;
DELETE FROM restaurants;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name)
VALUES ('User'),
       ('Admin');

INSERT INTO restaurants (name, votes)
VALUES ('Итальянский ресторан', 0),
       ('Суши бар', 0),
       ('Китайский ресторан', 0);

INSERT INTO dishes (name, price, date, restaurant)
VALUES ('Паста', 890, '2020-07-04', 100003),
        ('Спагетти', 486, '2020-07-03', 100003),
        ('Пицца', 562, '2020-07-04', 100003),
        ('Лазанья', 740, '2020-07-03', 100003),
        ('Роллы калифорния', 430, '2020-07-05', 100002),
        ('Суши с тунцом', 490, '2020-07-05', 100002),
        ('Сашими', 640, '2020-07-07', 100002),
        ('Сяке', 620, '2020-07-05', 100002),
        ('Лапша', 730, '2020-07-05', 100003),
        ('Утра по пекински', 1500, '2020-07-04', 100003),
        ('Димсамы', 350, '2020-07-04', 100003),
        ('Китайский суп', 520, '2020-07-05', 100003);
